{"6482": ["<div class='card'>", "<div class='card-header'>", "<a href=\"https://tools.ietf.org/html/rfc6482\" title=\"A Profile for Route Origin Authorizations (ROAs)\">A Profile for Route Origin Authorizations (ROAs)</a>\n", "</div>", "<div class='card-body'>", "<h5 class='card-title'>Targets: Relaying Parties, RIRs\n</h5>", "<h6 class='card-subtitle mb-2 text-muted'>Terminology</h6>", "<p class='card-text'>", "\n<span class='badge badge-success'>Route Origination Authorization (ROA)</span>\n<span class='badge badge-success'>RPKI</span>\n<span class='badge badge-success'>CMS</span>\n<span class='badge badge-success'>Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile</span>\n<span class='badge badge-success'>X.509 Extensions for IP Addresses and AS Identifiers RFC3779</span>\n<span class='badge badge-success'>Signed Object Template for the Resource Public Key Infrastructure (RPKI)</span>\n<span class='badge badge-success'>A Profile for X.509 PKIX Resource Certificates RFC6487</span>\n<span class='badge badge-success'>eContentType</span>\n<span class='badge badge-success'>encapContentInfo</span>\n<span class='badge badge-success'>Content-Type</span>\n<span class='badge badge-success'>SignerInfo</span>\n<span class='badge badge-success'>eContent</span>\n<span class='badge badge-success'>routeOriginAuthz</span>\n\n", "<hr/>", "Route Origination Authorization (ROA) is the component of RPKI that allow relaying parties to validate signed announcement/object. ROA format and generic validation procedure are based on <a href=\"https://tools.ietf.org/html/rfc5652\">Crytopgraphic Message Syntax (CMS) RFC5652</a> according to <a href=\"https://tools.ietf.org/html/rfc6488\">Signed Object Template for the Resource Public Key Infrastructure (RPKI) RFC6488</a>. A ROA is composed of:\n<ul>\n<li>The OID within the eContentType from the encapContentInfo object that identifies the signed object as being a ROA. The OID must also be present in the Content-Type signed attribute in the SignerInfo object.</li>\n<li>The eContent i.e. the payload that specifies the AS being authorized to originate routes as well as the prefixes to which the AS may originate routes.</li>\n<li>An additional step required to validate ROAs.</li>\n</ul>\nAn overview of the Signed Object Template for a ROA can been seen <a href=\"figure/rfc6482_roa_template.pdf\">here</a>. Picture below give lower resolution of Signed Object Template for a ROA\n<img src=\"figure/rfc6482_roa_template.jpg\" alt=\"Signed Object Template for a ROA\" />\nROA Content-Type is defined as routeOriginAuthz with numerical value of 1.2.840.113549.1.9.16.1.24(registered by IANA to RPKI ROA).The ROA eContent is unique per AS. If the address space holder needs to authorize multiple ASes to advertise the same set of address prefixes, the holder issues multiple ROAs, one per AS number. The ROA encapContentInfo in eContent is defined with:\n<ul>\n<li>IPAddress</li>\n<li>ROAIPAddress: sequence of IPAddresswith an optional maxLength. When present, the maxLength specifies the maximum length of the IP address prefix that the AS is authorized to advertise. Note that a valid ROA may contain an IP address prefix (within a ROAIPAddress element) that is encompassed by another IP address prefix (within a separate ROAIPAddress element)</li>\n<li>ROAIPAddressFamily: sequence of ROAIPAddress, each with his address family(IPv4 or IPv6)</li>\n<li>ASID: AS number</li>\n<li>RouteOriginAttestation: sequence of ASID and set of ROAIPAddressFamily with a default version parameterset as 0.</li>\n</ul>\nROA validation follow checking describe in <a href=\"https://tools.ietf.org/html/rfc6488\">Signed Object Template for the Resource Public Key Infrastructure (RPKI) RFC6488</a> as well as following additional ROA specific validation step.\nFollowing RPKI access control,only allowed relaying party can create a ROA associate with his resources. Also prefixes in ROA must match those in EE certificate. Prefixes in ROA are contained in a set of IP addresses specified in the IP address delegation extension of the EE certificate.\nSince ROA is part of RPKI and the goal of RPKI is authorization, there is no assumption of confidentiality or authentication for the data in ROA. Nevertheless, integrity of signed object like ROA must be guaranteed by taking advantage of the RPKI security mechanisms like the CMS.\n", "</p>", "</div>", "</div>"]}